src/Catalogs/Портфели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Портфели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Метапортфель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРебалансировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыРебалансировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПортфеля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тикер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипТикера</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставМетапортфеля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Портфель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Портфели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Портфели/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Метапортфель Тогда
		СоставПортфеля.Очистить();
		СоставМетапортфеля.Сортировать("Дата");
	Иначе 
		СоставМетапортфеля.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Метапортфель Тогда
		Для Каждого СтрокаТабЧасти Из СоставМетапортфеля Цикл
			Если СтрокаТабЧасти.Портфель.Метапортфель Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Использование вложенных метапортфелей не поддерживается!",,,, Отказ);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры
